#列表字典元组集合
#7、-列表------------------------------------------------------------------------------------------------------
'''
列表[]
列表中元素可以是任何数据类型，包括列表本身
列表中的元素可以通过索引表示,从0开始,负数索引从末端开始
添加：
(1).append 末尾添加数据
(2).insert(a , b) 索引为a后面插b
(3).extend([ , ]) 列表加多个数据
删除：
(1)del li[a] 删除索引a数据
(2).remove(a) 删除数据a
(3).pop(a) 删除指定索引a,并返回删除指定索引a的数据
查询：
(1).index(a) 查询指定数据a,不存在则报错
(2).count(a) 查询指定数据a的个数
排序：
(1).sort() 纯数字排序默认升序
反序：
(1).reverse() 数字进行倒序,不排序
'''
#8-字典-------------------------------------------------------------------------------------------------------
'''
不允许重复
创建：
(1)info={key1:value1,k2:v2} 创建字典
获取：
(1)print(info['k2']) 输出v2
(2)info.keys() 获取字典所有的key
(3)info.values() 获取字典所有的value
(4)info.items() 获取字典所有的key和value
添加：
(1)info[k3]=v3 字典添加 'k3':'v3'
(2)info.update({'k4':'v4','k5':'v5'}) 字典添加'k4':'v4' 'k5':'v5'
删除：
(1)del info['k2'] 删除v2
(2)info.pop('k2') 删除v2
(3)info.popitem() 删除最后一个键值对
(4)info.clear() 清除所有字典
查找：
(1)res = info['k2'] 查找字典k2对应的
(2)res = info.get('k2') 通过get获取value值
(3)res = info.get('k1134','不存在') 当无法查找到k1134,输出不存在
'''
#9、-元组---------------------------------------------------------------------------------------------------
'''
元组定义之后特点不能修改
tu = ()
用多个变量给元组解包
ss=(cccc,dddd)
a,b=ss
print(a)
print(b)
'''
#10、-集合----------------------------------------------------------------------------------------------------
'''
集合不支持索引
空集合用set()创建
集合中元素唯一,自动去重
集合内元素是无序的
集合内数据必须为不可变类型
可变：字典、列表、集合
不可变:int、float、bool、字符串、元组
创建:
(1)set=()
添加:
(1).add()
删除:
(1).pop()
(2).remove() 确信元素必须存在，且不存在即视为错误时使用
(3).discard() 不确定元素是否存在，且只想确保它被移除时使用
'''
#11、-集合运算--------------------------------------------------------------------------------------------------
'''
交集(a|b)
并集(a&b)
差集(a-b)
对称差集(a^b)
'''