'''
1-17基础语法

'''
#1、-定义-----------------------------------------------------------------------------------------------------
'''
定义一个变量
a=10;
print (a);
'''
#2、-字符串---------------------------------------------------------------------------------------------------
'''
文档字符串 Docstring
'''

'''
字符串练习
name = '哈基米'
sex = '猫'
age = 24
thing = '疯狂哈气'
end = 'GG'
print(name,sex,age,thing,end)
'''
#3.-词--------------------------------------------------------------------------------------------------------
'''
查找关键词
import keyword
print(keyword.kwlist)
['False', 'None', 'True', 'and', 'as', 'assert', 'async', 
'await', 'break', 'class', 'continue', 'def', 'del', 
'elif', 'else', 'except', 'finally', 'for', 'from', 
'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 
'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 
'with', 'yield']
'''

# 'ctrl+/'注释
# 'ctrl+shift+/'取消注释
# 'crtl+shift+f10'运行当前文件
#4、-格式----------------------------------------------------------------------------------------------------
'''
输出内容不换行
print ('kingfisher',end="")
print ('is a bird')
'''
#5-数据-------------------------------------------------------------------------------------------------------
'''
输入
desc=input()
输出
print(desc)
'''

'''
查看数据类型·
type()
'''

'''
随机数生成
impott random
整数
random.randint(1,100)
浮点数
random.uniform(1,100)
'''
#6、-字符串---------------------------------------------------------------------------------------------------
'''
字符串练习
s='123456789'
print(s,type(s))
s1=str()
print(s1,type(s1))
print(s[4])正向5
print(s[2])正向3
print(s[-2])方向倒数2
'''

'''
字符串切片
索引值获得部分片段内容
s='123456789'
print(s[2:5])# 从索引2到索引4(不包含索引5)
print(s[2:10:2])# 从索引2到索引9(不包含索引10),步长为2,即每隔一个字符取一个字符
print(s[2:10:3])# 从索引2到索引9(不包含索引10),步长为3,即每隔两个字符取一个字符
'''

'''
字符串拼接
a+b+c+d
join([a,b,c,d])
formatted_str()=f'{a}{b}{c}{d}'
formatted_str()='{}{}{}{}'.format(a,b,c,d)
'''

'''
格式化功能(宽度为10个字符)
{:<10} 左对齐
{:>10} 右对齐
{:^10} 中间对齐

pi=3.1415926
print(f'pi:{pi:<20}')  # 左对齐
print(f'pi:{pi:>20}')  # 右对齐 
print(f'pi:{pi:^20}')  # 中间对齐
--》输出结果
pi:3.1415926           
pi:           3.1415926
pi:     3.1415926      
'''

'''
特殊字符
\n 换行
\t 水平制表
r 原始字符串，忽略转义字符
'''

'''
join 字符串拼接
find 查找元素位置
count 查找元素个数
replace 替换字符
split 字符串分割
format 格式化输出
upper 大写字母
lower 小写字母
strip 去除空格
'''
#7、-列表------------------------------------------------------------------------------------------------------
'''
列表[]
列表中元素可以是任何数据类型，包括列表本身
列表中的元素可以通过索引表示,从0开始,负数索引从末端开始
添加：
(1).append 末尾添加数据
(2).insert(a , b) 索引为a后面插b
(3).extend([ , ]) 列表加多个数据
删除：
(1)del li[a] 删除索引a数据
(2).remove(a) 删除数据a
(3).pop(a) 删除指定索引a,并返回删除指定索引a的数据
查询：
(1).index(a) 查询指定数据a,不存在则报错
(2).count(a) 查询指定数据a的个数
排序：
(1).sort() 纯数字排序默认升序
反序：
(1).reverse() 数字进行倒序,不排序
'''
#8-字典-------------------------------------------------------------------------------------------------------
'''
不允许重复
创建：
(1)info={key1:value1,k2:v2} 创建字典
获取：
(1)print(info['k2']) 输出v2
(2)info.keys() 获取字典所有的key
(3)info.values() 获取字典所有的value
(4)info.items() 获取字典所有的key和value
添加：
(1)info[k3]=v3 字典添加 'k3':'v3'
(2)info.update({'k4':'v4','k5':'v5'}) 字典添加'k4':'v4' 'k5':'v5'
删除：
(1)del info['k2'] 删除v2
(2)info.pop('k2') 删除v2
(3)info.popitem() 删除最后一个键值对
(4)info.clear() 清除所有字典
查找：
(1)res = info['k2'] 查找字典k2对应的
(2)res = info.get('k2') 通过get获取value值
(3)res = info.get('k1134','不存在') 当无法查找到k1134,输出不存在
'''
#9、-元组---------------------------------------------------------------------------------------------------
'''
元组定义之后特点不能修改
tu = ()
用多个变量给元组解包
ss=(cccc,dddd)
a,b=ss
print(a)
print(b)
'''
#10、-集合----------------------------------------------------------------------------------------------------
'''
集合不支持索引
空集合用set()创建
集合中元素唯一,自动去重
集合内元素是无序的
集合内数据必须为不可变类型
可变：字典、列表、集合
不可变:int、float、bool、字符串、元组
创建:
(1)set=()
添加:
(1).add()
删除:
(1).pop()
(2).remove() 确信元素必须存在，且不存在即视为错误时使用
(3).discard() 不确定元素是否存在，且只想确保它被移除时使用
'''
#11、-集合运算--------------------------------------------------------------------------------------------------
'''
交集(a|b)
并集(a&b)
差集(a-b)
对称差集(a^b)
'''
#12、-程序结构和比较预算符-----------------------------------------------------------------------------------------
'''
任何数据可以通过bool()转换为布尔型,空数据为False,其他为Truth
与 and
或 or
非 not
查看ID值 id()返回的是一个对象在内存中的地址
is (Identity)：判断的是内存地址是否相同
== (Equal)：判断的是值是否相等
'''
#13、-条件分支---------------------------------------------------------------------------------------------------
'''
if 条件：
    输出
elif 条件：
    输出
else 条件：
    输出
'''
#14、-while循环-------------------------------------------------------------------------------------------------
'''
while 条件：
    语句块
continue 重新开始循环
break 结束循环
'''
#15、-for循环---------------------------------------------------------------------------------------------------
'''
for 变量 in 可迭代对象：
    语句块
(1)循环遍历s
for i in s:
    print("文本",i)
(2)循环遍历range
九九乘法表
for i in range (1,10):
    for j in range (1,i+1):
        print(f"{i}*{j}={i*j}",end=' ')
    print( )
'''
#16、-range循环---------------------------------------------------------------------------------------------------
'''
(1)range(x)生成从0到x-1的整数序列
(2)range(x,y)生成从x到y-1的整数序列
(3)range(x,y,z)生成从x到y-1的整数序列,步长为Z
'''
#17、-match表达式---------------------------------------------------------------------------------------------------
'''
match 表达式:
    case 模式1:
        语句块
    case 模式n:
        语句块
    case _:
        语句块n+1
'''
#18、-异常---------------------------------------------------------------------------------------------------------
'''
异常组成：
(1)异常类型
(2)异常组成:异常类型后面的文字
(3)异常溯源:显示调用栈的顺序,可找到出错位置
异常类型：
(1)SyntaxError:语法错误
(2)TypeError:类型错误
(3)IndexError:索引超出范围
(4)KeyError:字典中找不到对应的键
(5)ValueError:函数接收到值的类型正确，但值不在预期范围内
(6)ZeroDivisionError:除以零错误
(7)NameError:变量未定义
异常捕获：
try:
    语句块
except 异常类型(Exception所有类型) as e:

else:(没有异常时执行)
finally:(无论有无异常，都会执行)
例子：
读取信息：
try:
    with open("test.txt","r") as file:
        data = file.read()
        print("文档里的数据为",data)
except FileNotFoundError as e:
    print("文件不存在")
'''
#19、-函数---------------------------------------------------------------------------------------------------------
'''
def 函数名(参数)
    语句块
可变参数：
(1)*args:接受多传递的实参（位置参数:根据参数先后位置传值），以元组形式保存
(2)**kwargs:接受传递的实参（关键字参数：根据指定参数名称传递参数值），以字典形式保存
字符串注释（函数内）
"""

"""
作用域：
(1)定义在文件中的变量叫做全库变量，全局作用
(2)定义在函数内部的变量叫做局部变量，只作用在局部
(内置作用域(全局作用域(闭包函数作用域(局局部作用域)闭包函数作用域)局作用域)内置作用域)
LEGB:
Locl:局部作用域
Enclosing:闭包函数作用域
Global:全局作用域
Built-in:内置作用域
函数嵌套了另一个函数,内层函数能访问外层函数的变量,称为闭包(closure)
nonlocal(声明一个变量在嵌套函数的作用域,内层函数能修改外层函数的局部变量)
global(在函数内生成一个全局变量,可以在函数内修改)
常用内置函数：
(1)abs()绝对值
(2)all()可迭代数值全为真返回True,否则返回False
(3)any()可迭代数值至少有一个为真返回True,否则返回False
(4)bin()整数转换为二进制字符串
(5)bool()将数据转换为布尔值
(6)callable()检查对象是否可以被调用
(7)chr()将整数转换为对应字符(ASCII码或者Unicode)
(8)dict()创建为一个字典
(9)dir()返回对象属性和方法列表
(10)divmod()同时返回商和余数
(11)enumerate()为可迭代对象生成索引和元素对
(12)filter()筛选符合条件元素,返回过滤后的可迭代对象
(13)float()浮点
(14)int()整数
(15)isinstance()检查对象是否为某个类的实例
(16)len()返回对象长度
(17)list()可迭代对象转换为列表
(18)map()为可迭代对象的每个元素引用指定的函数,并返回一个新的可迭代对象
(19)max()/min()返回最大值/最小值
(20)open()打开一个文件,并返回文件对象
(21)pow()幂计算
(22)range()生成整数序列
(23)round()四舍五入到指定小数点
(24)sorted()返回一个从小到大排序后的新列表
(25)str()转换为字符串
(26)sum()返回序列中所有元素的和
(27)type()返回对象类型
(28)zip()将多个可迭代对象打包成一个元组列表
'''
