#程序结构和比较预算符条件分支while循环for循环range循环match表达式
#12、-程序结构和比较预算符-----------------------------------------------------------------------------------------
'''
任何数据可以通过bool()转换为布尔型,空数据为False,其他为Truth
与 and
或 or
非 not
查看ID值 id()返回的是一个对象在内存中的地址
is (Identity)：判断的是内存地址是否相同
== (Equal)：判断的是值是否相等
'''
#13、-条件分支---------------------------------------------------------------------------------------------------
'''
if 条件：
    输出
elif 条件：
    输出
else 条件：
    输出
'''
#14、-while循环-------------------------------------------------------------------------------------------------
'''
while 条件：
    语句块
continue 重新开始循环
break 结束循环
'''
#15、-for循环---------------------------------------------------------------------------------------------------
'''
for 变量 in 可迭代对象：
    语句块
(1)循环遍历s
for i in s:
    print("文本",i)
(2)循环遍历range
九九乘法表
for i in range (1,10):
    for j in range (1,i+1):
        print(f"{i}*{j}={i*j}",end=' ')
    print( )
'''
#16、-range循环---------------------------------------------------------------------------------------------------
'''
(1)range(x)生成从0到x-1的整数序列
(2)range(x,y)生成从x到y-1的整数序列
(3)range(x,y,z)生成从x到y-1的整数序列,步长为Z
'''
#17、-match表达式---------------------------------------------------------------------------------------------------
'''
match 表达式:
    case 模式1:
        语句块
    case 模式n:
        语句块
    case _:
        语句块n+1
'''