#1、-定义-----------------------------------------------------------------------------------------------------
'''
定义一个变量
a=10;
print (a);
'''
#2、-字符串---------------------------------------------------------------------------------------------------
'''
文档字符串 Docstring
'''

'''
字符串练习
name = '哈基米'
sex = '猫'
age = 24
thing = '疯狂哈气'
end = 'GG'
print(name,sex,age,thing,end)
'''
#3.-词--------------------------------------------------------------------------------------------------------
'''
查找关键词
import keyword
print(keyword.kwlist)
['False', 'None', 'True', 'and', 'as', 'assert', 'async', 
'await', 'break', 'class', 'continue', 'def', 'del', 
'elif', 'else', 'except', 'finally', 'for', 'from', 
'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 
'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 
'with', 'yield']
'''

# 'ctrl+/'注释
# 'ctrl+shift+/'取消注释
# 'crtl+shift+f10'运行当前文件
#4、-格式----------------------------------------------------------------------------------------------------
'''
输出内容不换行
print ('kingfisher',end="")
print ('is a bird')
'''
#5-数据-------------------------------------------------------------------------------------------------------
'''
输入
desc=input()
输出
print(desc)
'''

'''
查看数据类型·
type()
'''

'''
随机数生成
impott random
整数
random.randint(1,100)
浮点数
random.uniform(1,100)
'''
#6、-字符串---------------------------------------------------------------------------------------------------
'''
字符串练习
s='123456789'
print(s,type(s))
s1=str()
print(s1,type(s1))
print(s[4])正向5
print(s[2])正向3
print(s[-2])方向倒数2
'''

'''
字符串切片
索引值获得部分片段内容
s='123456789'
print(s[2:5])# 从索引2到索引4(不包含索引5)
print(s[2:10:2])# 从索引2到索引9(不包含索引10),步长为2,即每隔一个字符取一个字符
print(s[2:10:3])# 从索引2到索引9(不包含索引10),步长为3,即每隔两个字符取一个字符
'''

'''
字符串拼接
a+b+c+d
join([a,b,c,d])
formatted_str()=f'{a}{b}{c}{d}'
formatted_str()='{}{}{}{}'.format(a,b,c,d)
'''

'''
格式化功能(宽度为10个字符)
{:<10} 左对齐
{:>10} 右对齐
{:^10} 中间对齐

pi=3.1415926
print(f'pi:{pi:<20}')  # 左对齐
print(f'pi:{pi:>20}')  # 右对齐 
print(f'pi:{pi:^20}')  # 中间对齐
--》输出结果
pi:3.1415926           
pi:           3.1415926
pi:     3.1415926      
'''

'''
特殊字符
\n 换行
\t 水平制表
r 原始字符串，忽略转义字符
'''

'''
join 字符串拼接
find 查找元素位置
count 查找元素个数
replace 替换字符
split 字符串分割
format 格式化输出
upper 大写字母
lower 小写字母
strip 去除空格
'''
#7、-列表------------------------------------------------------------------------------------------------------
'''
列表[]
列表中元素可以是任何数据类型，包括列表本身
列表中的元素可以通过索引表示，从0开始，负数索引从末端开始
添加：
(1).append 末尾添加数据
(2).insert(a , b) 索引为a后面插b
(3).extend([ , ]) 列表加多个数据
删除：
(1)del li[a] 删除索引a数据
(2).remove(a) 删除数据a
(3).pop(a) 删除指定索引a，并返回删除指定索引a的数据
查询：
(1).index(a) 查询指定数据a，不存在则报错
(2).count(a) 查询指定数据a的个数
排序：
(1).sort() 纯数字排序默认升序
反序：
(1).reverse() 数字进行倒序,不排序
'''
#8-字典-------------------------------------------------------------------------------------------------------
'''
创建：
(1)info={key1:value1,k2:v2} 创建字典
获取：
(1)print(info['k2']) 输出v2
(2)info.keys() 获取字典所有的key
(3)info.values() 获取字典所有的value
(4)info.items() 获取字典所有的key和value
添加：
(1)info[k3]=v3 字典添加 'k3':'v3'
(2)info.update({'k4':'v4','k5':'v5'}) 字典添加'k4':'v4' 'k5':'v5'
删除：
(1)del info['k2'] 删除v2
(2)info.pop('k2') 删除v2
(3)info.popitem() 删除最后一个键值对
查找：
(1)res = info['k2'] 查找字典k2对应的
(2)res = info.get('k2') 通过get获取value值
(3)res = info.get('k1134','不存在') 当无法查找到k1134，输出不存在
'''
